---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.LoadTable
enum: Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule
source: html/7fa26a3f-1640-4497-c60d-ac7af7624bb7.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.LoadTable

This rule will apply the demand factor for the total load of attached objects to a panel.
 It is purely a look-up table. For example, if there are 5000 kVA, the user can specify 125% value is applied.
 If there are 20,000 kVA, the user can specify 100% value is applied.